app/Models/Msrole.php

    public function getOneByRoleId($roleid)
    {
        return $this->builder
            ->where('roleid', $roleid)
            ->get()->getRowArray();
---
SELECT *
FROM `msrole`
WHERE `roleid` = '1'