app/Models/Msuser.php

SELECT *
FROM `msuser`
WHERE `username` = 'admin'
---
    public function checkUser($username)
    {
        return $this->builder
            ->where('username', $username)
            ->get()->getRowArray();

SELECT *
FROM `msuser`
WHERE `userid` = 11
---
    public function getOne($userid)
    {
        return $this->builder
            ->where('userid', $userid)
            ->get()->getRowArray();