app/Models/Msuser.php

SELECT *
FROM `msuser`
---
    public function getAll()
    {
        return $this->builder->get()->getResultArray();